app/Controllers/Home.php

SELECT *
FROM `provinces`
---
   public function index(): string
{
    $data['villes'] = $this->villeModel->getAllVilles();
    $data['provinces'] = $this->provinceModel->findAll();