app/Controllers/VilleController.php

    public function index()
    {
        $data['villes'] = $this->villeModel->getAllVilles();
        $data['provinces'] = $this->provinceModel->findAll();
---
SELECT *
FROM `provinces`