app/Models/CityModel.php

        public function getCityDetails($id) {
        return $this->select('villes.*, nom_province AS nom_province')
                    ->join('provinces', 'provinces.id = villes.province_id')
                    ->where('villes.id', $id)
                    ->first();
---
SELECT `villes`.*, `nom_province` AS `nom_province`
FROM `villes`
JOIN `provinces` ON `provinces`.`id` = `villes`.`province_id`
WHERE `villes`.`id` = '29'
 LIMIT 1