app/Models/ProvinceModel.php

    public function getAllProvinces()
    {
        return $this->findAll();
---
SELECT *
FROM `provinces`

    public function get_province_by_name($name) {
        return $this->where('nom_province', $name)->first();
---
SELECT *
FROM `provinces`
WHERE `nom_province` = 'kwilu'
 LIMIT 1