app/Models/VilleModel.php

SELECT `villes`.*, `provinces`.`nom_province`
FROM `villes`
JOIN `provinces` ON `provinces`.`id` = `villes`.`province_id`
---
    public function getAllVilles()
    {
        return $this->select('villes.*, provinces.nom_province')
                    ->join('provinces', 'provinces.id = villes.province_id')
                    ->findAll();